0Bu/daikin-altherma-esp32/main/config.cpp
// Runtime config: daik::Config backed by NVS, seeded from Kconfig defaults. See config.hpp.
#include "config.hpp"
#include "nvs_storage.hpp"
#include "diag_log.hpp"
#include "logic/config_store.hpp"   // ConfigBlob (de)serialize — the atomic CRC-checked config blob
#include "logic/weather_forecast.hpp"
#include "logic/board_presets.hpp"
#include "logic/env3.hpp"
#include "sdkconfig.h"
#include "soc/soc_caps.h"   // SOC_GPIO_PIN_COUNT — per-target GPIO count for the link-pin check
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "rtos_guard.hpp"   // SemGuard — the ONE unwind-safe mutex guard
#include <cstdlib>          // abort() — the fail-stop when the config mutex can't be created
#include <vector>

namespace daik {

static Config            g_cfg;
static SemaphoreHandle_t g_mtx = nullptr;   // guards g_cfg; created in config_load() before tasks start

// The board-local hardware as this BUILD was configured — the first-boot / recovery values for the
// indicator + recovery button, exactly as CONFIG_DAIKIN_RX_PIN is for the X10A link. Kconfig is the
// default only; NVS is the authority once the user has saved anything (POST /set_board), which is
// what lets one published image serve boards with different onboard parts.
static void seed_board_defaults(Config& c) {
#if CONFIG_DAIKIN_STATUS_LED_ENABLE
    c.led_gpio = CONFIG_DAIKIN_STATUS_LED_GPIO;
#else
    c.led_gpio = -1;
#endif
#ifdef CONFIG_DAIKIN_STATUS_LED_WS2812
    c.led_type = static_cast<int>(LedType::Ws2812);
#else
    c.led_type = static_cast<int>(LedType::Gpio);
#endif
#ifdef CONFIG_DAIKIN_STATUS_LED_INVERTED
    c.led_inverted = true;
#else
    c.led_inverted = false;
#endif
    c.btn_gpio = CONFIG_DAIKIN_BUTTON_GPIO;
#ifdef CONFIG_DAIKIN_BUTTON_ACTIVE_LOW
    c.btn_active_low = true;
#else
    c.btn_active_low = false;
#endif
}

// RAII guard around g_mtx. Releases on exception too, so a std::bad_alloc thrown while copying
// g_cfg's std::strings can't leave the mutex held (which would deadlock every later config() call).
namespace {
// The ONE unwind-safe mutex guard, shared by every file in this firmware (main/rtos_guard.hpp).
// This used to be a private copy here; nine of them had drifted into two different shapes.
using Lock = SemGuard;
}  // namespace

// Return a CONSISTENT SNAPSHOT (by value) taken under the lock: a reader never observes a torn
// Config while a writer swaps g_cfg (config_save / config_set_runtime run from the HTTP and poll
// tasks). Callers bind `const Config& c = config();` -> the returned temporary is lifetime-extended,
// giving them a stable copy for the rest of the scope.
Config config() {
    Lock lk(g_mtx);
    return g_cfg;
}

static void publish(const Config& c) {
    Lock lk(g_mtx);
    g_cfg = c;
}

void config_load() {
    g_mtx = xSemaphoreCreateMutex();
    // FAIL STOP if the config mutex can't be created. config() is read + written concurrently by the
    // httpd and poll tasks; without the mutex it hands out TORN std::string snapshots — a real data
    // race, not a cosmetic one. Logging and continuing (the old behaviour) is not fail-safe. A mutex
    // alloc failing this early means the heap is exhausted before any task exists, so there is no safe
    // degraded mode to fall into — abort so the reset reason + coredump are visible, rather than run
    // with silent memory corruption. (Reviewed: F04.)
    if (!g_mtx) {
        ESP_LOGE("config", "config mutex alloc failed at boot — aborting (cannot run config unsynchronized)");
        abort();
    }
    Config c;
    // Persisted user settings: WiFi + MQTT + syslog + NTP. These are read FIRST from the atomic
    // CRC-checked "cfg" blob (logic/config_store.hpp); it is written all-or-nothing by config_save, so
    // it is never half-updated. If it is absent (a fresh device, or an OTA upgrade from the pre-blob
    // per-key layout) or fails its CRC, fall back to the legacy individual keys — which for a fresh
    // device are just the Kconfig defaults. (The hostname is fixed at CONFIG_DAIKIN_HOSTNAME, the poll
    // cadence at POLL_INTERVAL_S, labels are English-only.)
    ConfigBlob b;
    std::vector<uint8_t> raw;
    const bool blob_loaded = nvs_get_blob("cfg", raw) &&
                             config_blob_deserialize(raw.data(), raw.size(), b);
    if (blob_loaded) {
        c.wifi_ssid = b.wifi_ssid;                     c.wifi_pass = b.wifi_pass;
        c.wifi_ssid_backup = b.wifi_ssid_backup;       c.wifi_pass_backup = b.wifi_pass_backup;
        c.wifi_rollback_active = b.wifi_rollback_active; c.wifi_rolled_back = b.wifi_rolled_back;
        c.mqtt_uri = b.mqtt_uri;   c.mqtt_user = b.mqtt_user;   c.mqtt_pass = b.mqtt_pass;
        // Gated on has_mqtt_base only for symmetry with the other appended blocks — a pre-v16 blob
        // decodes the member empty anyway, and empty already MEANS the compile-time default
        // (logic/mqtt_base.hpp). There is deliberately no Kconfig fallback to apply here: unlike the
        // board block, "absent" and "default" are the same state for this field.
        if (b.has_mqtt_base) c.mqtt_base = b.mqtt_base;
        if (b.has_ref_temp) {
            c.ref_temp_name = b.ref_temp_name; c.ref_temp_topic = b.ref_temp_topic;
            c.ref_temp_path = b.ref_temp_path; c.ref_temp_time_path = b.ref_temp_time_path;
            c.ref_temp_setpoint_path = b.ref_temp_setpoint_path;
            c.ref_temp_setpoint_topic = b.has_ref_multi_source
                ? b.ref_temp_setpoint_topic
                : (b.ref_temp_setpoint_path.empty() ? "" : b.ref_temp_topic);
            c.ref_temp_time_topic = b.has_ref_multi_source
                ? b.ref_temp_time_topic
                : (b.ref_temp_time_path.empty() ? "" : b.ref_temp_topic);
            if (b.has_ref_multi_source && b.ref_temp_fixed_setpoint_tenths <= UINT16_MAX)
                c.ref_temp_fixed_setpoint_tenths =
                    static_cast<uint16_t>(b.ref_temp_fixed_setpoint_tenths);
            c.ref_temp_enabled_path = b.ref_temp_enabled_path;
            c.ref_temp_hvac_mode_path = b.ref_temp_hvac_mode_path;
            c.ref_temp_max_age_s = b.ref_temp_max_age_s;
        }
        if (b.has_weather) {
            c.weather_enabled = b.weather_enabled;
            c.weather_latitude_e6 = b.weather_latitude_e6;
            c.weather_longitude_e6 = b.weather_longitude_e6;
        }
        if (b.has_diagnostics) {
            c.diagnostics_enabled = b.diagnostics_enabled;
            c.diagnostics_generation = b.diagnostics_generation;
        }
        if (b.has_circulation && b.circulation_on_tenths_w <= UINT16_MAX &&
            b.circulation_off_tenths_w <= UINT16_MAX && b.circulation_confirm_s <= UINT16_MAX) {
            const uint16_t on_w = static_cast<uint16_t>(b.circulation_on_tenths_w);
            const uint16_t off_w = static_cast<uint16_t>(b.circulation_off_tenths_w);
            const uint16_t confirm_s = static_cast<uint16_t>(b.circulation_confirm_s);
            const char* why = nullptr;
            if (circulation_source_config_valid(
                    b.circulation_name, b.circulation_topic, b.circulation_power_path,
                    b.circulation_time_path, b.circulation_max_age_s, on_w, off_w,
                    confirm_s, &why)) {
                c.circulation_name = b.circulation_name;
                c.circulation_topic = b.circulation_topic;
                c.circulation_power_path = b.circulation_power_path;
                c.circulation_time_path = b.circulation_time_path;
                c.circulation_max_age_s = b.circulation_max_age_s;
                c.circulation_on_tenths_w = on_w;
                c.circulation_off_tenths_w = off_w;
                c.circulation_confirm_s = confirm_s;
            } else {
                diag_printf("config: invalid circulation source ignored (%s)\n",
                            why ? why : "invalid config");
            }
        }
        c.syslog_host = b.syslog_host; c.syslog_port = b.syslog_port; c.ntp_server = b.ntp_server;
        // has_board is false for a blob written before the board block existed (v1). Those fields
        // were compile-time then, so "absent" must read as the Kconfig default, NOT as disabled —
        // otherwise the OTA that introduces this feature turns a XIAO user's working LED off.
        if (b.has_board) {
            c.led_gpio = b.led_gpio; c.led_type = b.led_type; c.led_inverted = b.led_inverted;
            c.btn_gpio = b.btn_gpio; c.btn_active_low = b.btn_active_low;
        } else {
            seed_board_defaults(c);
        }
        // The OTA channel (blob v3). has_ota == false is a blob written before the channel existed,
        // i.e. a device from the era when there was exactly ONE feed — which is the release channel.
        // So absent and "release" mean the same thing here (unlike the board block above, where
        // absent had to fall back to Kconfig); the struct default already says so.
        if (b.has_ota) c.ota_channel = ota_channel_from_int(b.ota_channel);
        // The UI language (blob v4). has_lang == false is a blob written before the override existed;
        // absent means "auto" (keep letting the browser decide), which the struct default already
        // says — like the channel above, and unlike the board block, there is no Kconfig fallback.
        if (b.has_lang) c.ui_lang = ui_lang_from_int(b.ui_lang);
        // The HomeHub Modbus stack (blob v5/v6 plus the v18 discovery latch). Any pre-v18 blob that
        // already carried this block migrates to discovery_done=true: its empty host may be an
        // explicit deletion and consent cannot be reconstructed. A fresh/pre-v5 device remains
        // pending and gets exactly one automatic search on its first networked boot.
        if (b.has_modbus) {
            c.mb_host           = b.mb_host;
            c.mb_port           = b.mb_port;
            c.mb_unit_id        = b.mb_unit_id;
        }
        c.mb_discovery_done = config_modbus_discovery_done_on_load(
            b.has_modbus, b.has_modbus_discovery_state, b.mb_discovery_done);
        if (b.has_env3) {
            c.env3_enabled = b.env3_enabled;
            c.env3_sda = b.env3_sda;
            c.env3_scl = b.env3_scl;
        }
        if (b.has_board_identity) {
            c.board_user_set = b.board_user_set;
            c.board_preset_id = static_cast<BoardPresetId>(b.board_preset_id);
        }
    } else {
        // Legacy / first-boot fallback (per-key + Kconfig defaults).
        c.wifi_ssid = nvs_get_str("wifi_ssid", CONFIG_DAIKIN_WIFI_SSID);
        c.wifi_pass = nvs_get_str("wifi_pass", CONFIG_DAIKIN_WIFI_PASSWORD);
        c.wifi_ssid_backup = nvs_get_str("wifi_ssid_back", "");
        c.wifi_pass_backup = nvs_get_str("wifi_pass_back", "");
        c.wifi_rollback_active = nvs_get_i32("wifi_rollback", 0) != 0;
        c.wifi_rolled_back = nvs_get_i32("wifi_rolledbk", 0) != 0;
        c.mqtt_uri  = nvs_get_str("mqtt_uri", CONFIG_DAIKIN_MQTT_BROKER_URI);
        c.mqtt_user = nvs_get_str("mqtt_user", CONFIG_DAIKIN_MQTT_USERNAME);
        c.mqtt_pass = nvs_get_str("mqtt_pass", CONFIG_DAIKIN_MQTT_PASSWORD);
        c.syslog_host = nvs_get_str("syslog_host", CONFIG_DAIKIN_SYSLOG_HOST);
        c.syslog_port = nvs_get_i32("syslog_port", CONFIG_DAIKIN_SYSLOG_PORT);
        c.ntp_server = nvs_get_str("ntp_server", CONFIG_DAIKIN_NTP_SERVER);
        seed_board_defaults(c);   // the legacy layout never held these — Kconfig is all there is
    }
    // Before blob v12 the separate `board_set` key recorded only that the hardware form had been
    // submitted. Recover the same preset name that old UI derived from the stored fields, but never
    // infer from untouched defaults (`board_set` absent/false). The next ordinary save writes the
    // explicit id atomically into the current blob.
    if (blob_loaded && !b.has_board_identity) {
        c.board_user_set = nvs_get_i32("board_set", 0) != 0;
        c.board_preset_id = board_legacy_preset_id(c);
    }
    // Re-check the board-local pins on the way IN, for the same reason the X10A pair is re-checked
    // below: NVS holds whatever an older build, a different board's blob or a hand-crafted POST put
    // there, and both of these pins are DRIVEN (an output, or an input with a pull). A bad one is
    // not cosmetic — pointing the indicator at a flash pad corrupts flash traffic, and pointing the
    // button at a floating pad factory-resets the device by itself. The link pins are excluded from
    // this particular check (rx/tx are re-validated separately, just below, against the board pins
    // that survive here) so the two checks can't deadlock each other into rejecting both.
    {
        Config probe = c;
        probe.rx_pin = probe.tx_pin = -1;
        std::string why;
        if (!board_hw_valid(probe, why, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi())) {
            diag_printf("config: persisted board hardware rejected (%s; led=%d type=%d btn=%d) "
                        "— using build defaults\n", why.c_str(), c.led_gpio, c.led_type, c.btn_gpio);
            seed_board_defaults(c);
            // The statement is revoked WITH the values it was about: what is live now is the build's
            // guess, not the user's. Leaving the flag set would let the modal name a board out of
            // pins the device just refused to drive.
            c.board_user_set = false;
            c.board_preset_id = BoardPresetId::Custom;
            probe = c;
            probe.rx_pin = probe.tx_pin = -1;
            // A build whose OWN defaults don't validate is a misconfigured Kconfig, not user input.
            // Disable both rather than drive a pin that just failed the safety rule twice.
            if (!board_hw_valid(probe, why, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi())) {
                diag_printf("config: build board defaults also rejected (%s) — indicator + button off\n",
                            why.c_str());
                c.led_gpio = -1;
                c.btn_gpio = -1;
            }
        }
    }
    {
        std::string why;
        if (!board_identity_valid(c, why)) {
            diag_printf("config: persisted board identity rejected (%s; id=%d) — using Custom\n",
                        why.c_str(), static_cast<int>(c.board_preset_id));
            c.board_preset_id = BoardPresetId::Custom;
        }
    }
    // "" (either no ntp_server yet, or an explicit empty save via POST /set_ntp) falls back to the
    // Kconfig default — unlike syslog_host, an empty ntp_server is not a disabled state to preserve.
    if (c.ntp_server.empty()) c.ntp_server = CONFIG_DAIKIN_NTP_SERVER;
    if (!weather_location_e6_valid(c.weather_enabled, c.weather_latitude_e6,
                                   c.weather_longitude_e6)) {
        diag_printf("config: persisted Open-Meteo location rejected — weather forecast disabled\n");
        c.weather_enabled = false;
        c.weather_latitude_e6 = 0;
        c.weather_longitude_e6 = 0;
    }

    // Persisted X10A LINK cache: RX/TX pins + protocol. The wiring is physically boot-invariant, so
    // it is cached (fallback = compile-time Kconfig default) and tried FIRST by the detection sweep;
    // a change is re-persisted (hp_poll.cpp poll_detect). The sweep still tries the defaults too, so
    // a stale cache self-heals. The MODEL is NOT persisted — profile + fingerprint below stay the
    // sentinel/empty and are re-detected on every boot (a swapped unit is re-identified).
    c.rx_pin       = nvs_get_i32("rx_pin", CONFIG_DAIKIN_RX_PIN);
    c.tx_pin       = nvs_get_i32("tx_pin", CONFIG_DAIKIN_TX_PIN);
    // Optional hardware fails closed on an invalid persisted mapping. Disabling it keeps the UI
    // reachable without claiming or driving a bad pad; the stored pins remain visible for repair.
    {
        std::string why;
        if (!env3_config_valid(c, why, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi())) {
            diag_printf("config: persisted ENV III config rejected (%s; sda=%d scl=%d) — disabled\n",
                        why.c_str(), c.env3_sda, c.env3_scl);
            c.env3_enabled = false;
        }
    }
    // Re-check the pair on the way IN. BOTH write paths commit rx_pin and tx_pin as two independent
    // NVS writes — config_save and, since the field-owned split, config_save_link — so a save cut or
    // failed between them leaves a pair on flash the request path would have rejected outright:
    // correcting a swapped wire {44,43} -> {43,44} with only the rx write through leaves rx == tx ==
    // 43. Naming the failing key on /diag (put_i32) reports that write; it does not undo the one that
    // landed. validate() enforces the pair, but only on the request path (http_config.cpp); NVS stops
    // being trusted the moment a partial write is possible.
    // A guard, not a repair: the sweep already drops an rx == tx candidate and falls back to these
    // same defaults (hp_detect.cpp), so the bus still comes up. link_pins_safe adds the checks the
    // sweep lacks — the upper GPIO bound AND the chip-reserved-pin rule (board_pins.hpp), the same
    // rule the request path enforces (validate) — so a pair that reaches flash via a curl POST to
    // /set_hp (flash/strapping/JTAG pad) is not silently re-tried every boot into a crash loop, and
    // /status never reports an unconfigurable link as fact. Not re-persisted: poll_detect writes the
    // winning pins back once the bus answers; until then the line below repeats each boot.
    if (!link_pins_safe(c.rx_pin, c.tx_pin, hw_octal_spi(), config_reserved_pins(c),
                        SOC_GPIO_PIN_COUNT - 1)) {
        diag_printf("config: persisted X10A pins rejected (rx=%d tx=%d) — using build defaults %d/%d\n",
                    c.rx_pin, c.tx_pin, CONFIG_DAIKIN_RX_PIN, CONFIG_DAIKIN_TX_PIN);
        c.rx_pin = CONFIG_DAIKIN_RX_PIN;
        c.tx_pin = CONFIG_DAIKIN_TX_PIN;
    }
    // The fallback pair above can itself collide with ENV III (for example a damaged link cache is
    // replaced by the XIAO 44/43 defaults while an ENV mapping already uses them). Optional ENV
    // yields to the primary X10A link; re-check the final pair before either driver starts.
    if (c.env3_enabled) {
        std::string why;
        if (!env3_config_valid(c, why, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi())) {
            diag_printf("config: ENV III disabled after X10A fallback (%s; sda=%d scl=%d)\n",
                        why.c_str(), c.env3_sda, c.env3_scl);
            c.env3_enabled = false;
        }
    }
    c.proto        = parse_protocol(nvs_get_str("proto", CONFIG_DAIKIN_PROTOCOL));
    // Old development builds persisted discovery-result keys outside the atomic blob. They remain
    // ignored: v18 owns the one-shot decision atomically beside the host it applies to.
    c.profile      = "auto";
    c.fp_pages        = 0;
    c.fp_kw_tenths    = -1;
    c.fp_iu_kw_tenths = -1;
    c.fp_eeprom       = "";
    c.fp_valid        = false;
    publish(c);
}

// One NVS write, with the failure named on /diag + syslog. The callers only learn THAT the save
// failed (they turn it into a 500); without this line nobody could tell which key died or why —
// a full partition and a wedged flash both surface as a bare "config write failed".
static bool put_str(const char* key, const std::string& val) {
    esp_err_t e = nvs_set_str(key, val);
    if (e != ESP_OK) diag_printf("config: NVS write failed key=%s err=%s\n", key, esp_err_to_name(e));
    return e == ESP_OK;
}
static bool put_i32(const char* key, int32_t val) {
    esp_err_t e = nvs_set_i32(key, val);
    if (e != ESP_OK) diag_printf("config: NVS write failed key=%s err=%s\n", key, esp_err_to_name(e));
    return e == ESP_OK;
}

