0Bu/daikin-altherma-esp32/main/config.cpp
bool config_save(const Config& requested, bool require_link) {
    // Persist user settings (WiFi + MQTT + syslog + NTP) and the X10A link cache (RX/TX pins +
    // protocol). The MODEL is intentionally NOT written — profile + fingerprint (fp_*) are re-derived
    // every boot.
    //
    // ATOMIC credential/service save (F02). The credential + service fields go into ONE CRC-checked
    // blob (logic/config_store.hpp) written with a single nvs_set_blob. That entry is atomic — either
    // the whole new blob lands or the previous one survives — so the save is all-or-nothing across
    // both a mid-write NVS failure AND a power cut, with no per-key rollback and no write-ordering to
    // get right (the old multi-commit save needed both, and still left a partial state on a rollback
    // that could not complete). Every runtime call is serialized on the httpd task; initial HomeHub
    // discovery is the one boot call and finishes before httpd starts. The poll task
    // (config_save_link) can therefore never revert a credential change — the field-ownership
    // guarantee is kept without narrow per-key writes.
    // Diagnostics consent and its generation ride atomically with every dependent source. The
    // heating-curve diagnosis still derives its remaining prerequisites from the MQTT room source
    // and active HomeHub on every evaluation; forecast remains optional comparison evidence.
    Config c = requested;
    ConfigBlob b;
    b.wifi_ssid = c.wifi_ssid;                 b.wifi_pass = c.wifi_pass;
    b.wifi_ssid_backup = c.wifi_ssid_backup;   b.wifi_pass_backup = c.wifi_pass_backup;
    b.wifi_rollback_active = c.wifi_rollback_active; b.wifi_rolled_back = c.wifi_rolled_back;
    b.mqtt_uri = c.mqtt_uri;   b.mqtt_user = c.mqtt_user;   b.mqtt_pass = c.mqtt_pass;
    b.mqtt_base = c.mqtt_base;
    b.ref_temp_name = c.ref_temp_name; b.ref_temp_topic = c.ref_temp_topic;
    b.ref_temp_path = c.ref_temp_path; b.ref_temp_time_path = c.ref_temp_time_path;
    b.ref_temp_setpoint_topic = c.ref_temp_setpoint_topic;
    b.ref_temp_time_topic = c.ref_temp_time_topic;
    b.ref_temp_fixed_setpoint_tenths = c.ref_temp_fixed_setpoint_tenths;
    b.ref_temp_setpoint_path = c.ref_temp_setpoint_path;
    b.ref_temp_enabled_path = c.ref_temp_enabled_path;
    b.ref_temp_hvac_mode_path = c.ref_temp_hvac_mode_path;
    b.ref_temp_max_age_s = c.ref_temp_max_age_s;
    b.circulation_name = c.circulation_name;
    b.circulation_topic = c.circulation_topic;
    b.circulation_power_path = c.circulation_power_path;
    b.circulation_time_path = c.circulation_time_path;
    b.circulation_max_age_s = c.circulation_max_age_s;
    b.circulation_on_tenths_w = c.circulation_on_tenths_w;
    b.circulation_off_tenths_w = c.circulation_off_tenths_w;
    b.circulation_confirm_s = c.circulation_confirm_s;
    b.weather_enabled = c.weather_enabled;
    b.weather_latitude_e6 = c.weather_latitude_e6;
    b.weather_longitude_e6 = c.weather_longitude_e6;
    b.diagnostics_enabled = c.diagnostics_enabled;
    b.diagnostics_generation = c.diagnostics_generation;
    b.env3_enabled = c.env3_enabled; b.env3_sda = c.env3_sda; b.env3_scl = c.env3_scl;
    b.board_preset_id = static_cast<int32_t>(c.board_preset_id);
    b.board_user_set = c.board_user_set;
    b.syslog_host = c.syslog_host; b.syslog_port = c.syslog_port; b.ntp_server = c.ntp_server;
    // Board-local hardware rides the same atomic blob: like the credentials it has exactly ONE
    // writer (the httpd task, POST /set_board), so it needs no self-healing per-key treatment — and
    // being in the blob is what makes "save the indicator pin" all-or-nothing rather than a pin
    // written without its polarity.
    b.led_gpio = c.led_gpio; b.led_type = c.led_type; b.led_inverted = c.led_inverted;
    b.btn_gpio = c.btn_gpio; b.btn_active_low = c.btn_active_low;
    // The OTA channel rides the same blob for the same reason: one writer (POST /set_ota, httpd).
    b.ota_channel = ota_channel_to_int(c.ota_channel);
    // The UI language likewise: one writer (POST /set_lang, httpd), one persistent user choice.
    b.ui_lang = ui_lang_to_int(c.ui_lang);
    // The HomeHub Modbus stack rides the same blob. POST /set_hp is its normal writer; the one-time
    // boot discovery writes before httpd starts, so the whole-blob ownership remains serialized.
    b.mb_host           = c.mb_host;
    b.mb_port           = c.mb_port;
    b.mb_unit_id        = c.mb_unit_id;
    b.mb_discovery_done = c.mb_discovery_done;
    // REFUSE TO WRITE A BLOB THIS BUILD COULD NOT READ BACK. The decoder rejects the whole blob if any
    // string exceeds CONFIG_BLOB_MAX_STR, and the fallback is the legacy per-key layout a blob-era
    // device never populated — so writing one does not save a slightly-wrong config, it silently
    // destroys the whole config at the next boot (WiFi, MQTT, syslog, NTP, board, OTA channel,
    // language, ENV III, both MQTT sources, the weather location) and comes up in the setup portal.
    // Checked here rather than trusted from the routes because this is the last point where every
    // field is together, and it is the one guarantee the atomic-blob design rests on.
    if (!config_blob_strings_fit(b)) {
        diag_printf("config: refusing to save — a setting exceeds the %u-byte field limit\n",
                    static_cast<unsigned>(CONFIG_BLOB_MAX_STR));
        return false;
    }
    const std::vector<uint8_t> blob = config_blob_serialize(b);

    const esp_err_t e = nvs_set_blob("cfg", blob.data(), blob.size());
    if (e != ESP_OK) {
        // The atomic write failed, so the PREVIOUS blob is still intact — nothing net saved. Don't
        // publish RAM; the caller turns `false` into a 500 and skips the reboot.
        diag_printf("config: NVS blob write failed key=cfg err=%s — nothing saved\n", esp_err_to_name(e));
        return false;
    }

    // The X10A LINK cache (RX/TX/proto) stays as separate self-healing keys, NOT in the blob: it has
    // two owners (this path for a manual /set_hp override, and the poll task's config_save_link for a
    // detected pin), and a partial write self-heals on the next detect and is re-validated on load by
    // link_pins_safe. Written AFTER the blob so a link-key hiccup never taints the atomic credential
    // save; the credential/service state is already durably committed by the time we get here.
    bool link_ok = true;
    link_ok &= put_i32("rx_pin", c.rx_pin);
    link_ok &= put_i32("tx_pin", c.tx_pin);
    link_ok &= put_str("proto", std::string(1, static_cast<char>(c.proto)));
    if (!link_ok)
        diag_printf("config: link-cache key write failed after the atomic blob save "
                    "(self-heals on the next detect; re-validated on load)\n");
    if (!config_save_succeeded(/*blob_ok=*/true, link_ok, require_link)) {
        // /set_hp owns the link and cannot call this a save when its cache did not land. Do not
        // publish its requested pins to RAM or wake the poll task. (The atomic blob also landed, but
        // /set_hp changed none of its fields; for every other route that blob is the requested save.)
        return false;
    }
    publish(c);
    return true;
}

// ── Field-owned commits (the detection path) ─────────────────────────────────────────────────────
// These exist so the poll task never writes a field it doesn't own. It snapshots the config, then
// spends a whole sweep off-lock probing the bus; committing that stale snapshot back would revert
// any /set_wifi or /set_mqtt that landed meanwhile. See logic/config_model.hpp's ownership note.

bool config_save_link(int rx_pin, int tx_pin, Protocol proto) {
    // NVS first, off-lock (flash writes are slow — readers shouldn't queue behind them), and only
    // the three link keys: the caller's credentials are never carried along.
    bool ok = true;
    ok &= put_i32("rx_pin", rx_pin);
    ok &= put_i32("tx_pin", tx_pin);
    ok &= put_str("proto", std::string(1, static_cast<char>(proto)));
    // Patch RAM even when the cache write failed, unlike /set_hp's require_link config_save call:
    // this link is PROVEN — the bus just answered on it — and the poll engine reads the pins from
    // here every cycle. Refusing the patch would leave it hammering pins known not to work. A
    // failed write only costs the cache (detection re-runs next boot); `false` tells the caller.
    {
        Lock lk(g_mtx);
        apply_link(g_cfg, rx_pin, tx_pin, proto);
    }
    return ok;
}

// RAM-only by design: the model is re-detected every boot, so there is nothing to persist and no
// failure to report. Allocation happens at the call site, not under the lock (apply_model swaps).
void config_set_model(std::string profile, uint32_t fp_pages, int fp_kw_tenths, int fp_iu_kw_tenths,
                      std::string fp_eeprom) {
    Lock lk(g_mtx);
    apply_model(g_cfg, std::move(profile), fp_pages, fp_kw_tenths, fp_iu_kw_tenths,
                std::move(fp_eeprom));
}

// Whole-struct RAM publish (no NVS). Sole caller is POST /detect (http_config.cpp), which resets
// profile->"auto" + clears the fingerprint: acceptable as a whole-struct write because it runs on the
// httpd task, which OWNS the credential fields (serialized against the other /set_* handlers), so it
// cannot revert them. The poll task must NOT use this — it uses the field-owned config_set_model.
void config_set_runtime(const Config& c) { publish(c); }

// Kconfig-derived hardware facts (see config.hpp). Kept here — the one file that already owns the
// CONFIG_* → link mapping — so board_pins' octal_spi/reserved inputs have a single source of truth
// rather than a #if block duplicated across http_status.cpp, http_config.cpp and config_load().
bool hw_octal_spi() {
#if defined(CONFIG_ESPTOOLPY_OCT_FLASH) || defined(CONFIG_SPIRAM_MODE_OCTAL)
    return true;
#else
    return false;
#endif
}

} // namespace daik
